---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.AdjustEndCurtainWallParameterNoCorners
source: html/d46aa2ba-8710-94a7-b659-15e7d1f5bc6a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.AdjustEndCurtainWallParameterNoCorners Property

Can't put Corner Mullion at end joined to non-Curtain Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId AdjustEndCurtainWallParameterNoCorners { get; }
```